package ua.javarush.task.pro.task17.task1701;

//Клас Bat (кажан) успадковано від класу Animal (тварина). Усе логічно, от тільки під час виклику методу move() для об'єкта класу Bat у консоль буде виведено "Я біжу!".
//Навіщо ж бігти, якщо ти вмієш літати?
//Перевизнач метод move() для класу Bat, щоб він виводив у консоль "Я лечу!".
//Метод main() у тестуванні не використовується.
//
//
//Requirements:
//1. Клас Animal не змінюй.
//2. Клас Bat має успадковуватися від Animal.
//3. У класі Bat має бути перевизначено метод move().
//4. Метод move(), викликаний для об'єкта класу Bat, має виводити в консоль "Я лечу!".
public class Solution {
    public static void main(String[] args) {
        Bat bat = new Bat();
        bat.move();
    }
}
