package ua.javarush.task.pro.task08.task0805;

/* 
Magic 8 ball
Щоб розв'язати цю задачу, тобі належить у класі MagicBall реалізувати метод getPrediction(), який працюватиме як куля передбачень.
«Куля» випадковим чином повертає фразу-відповідь на поставлене запитання. У методі getPrediction() потрібно
 використовувати метод nextInt(int) класу Random. Він має повертати значення від 0 до 7 включно.
Залежно від результату роботи методу nextInt(int) повертається один з варіантів відповіді:
0 -> Безперечно
1 -> Безумовно, так
2 -> Найймовірніше
3 -> Хороші перспективи
4 -> Запитай пізніше
5 -> Спробуй ще
6 -> Моя відповідь — ні
7 -> Вельми сумнівно
Інакше повернути null.
*/

public class Solution {

    public static void main(String[] args) {
        System.out.println("Чи зароблю я собі на BMW?");
        System.out.println(MagicBall.getPrediction());
    }
}
